01  WS-AREA. 
05  WS-VAR1 PIC 9(5) VALUE 12345. 
05  WS-VAR2 PIC 9(5) VALUE 0. 

PROCEDURE DIVISION. 
    COMPUTE WS-VAR2 = WS-VAR1 / 0. 
    DISPLAY "Result: " WS-VAR2 
    STOP RUN.